## CONTENT LIST
1. Importing Libraries
2. Importing Data
3. Checking Data 
4. Merge orders_products_combined with Product Data
5. Export data

## 01. Importing Libraries

In [1]:
#Import Libraries
import pandas as pd
import numpy as np
import os

## 02. Importing Data

In [2]:
#Importing orders_products_combined & products_cleaned

path = r'C:\Users\chery\Desktop\CareerFoundry\Immersion Data Analytics\Achievement 4\02-2022 Instacart Basket Analysis'

In [3]:
df_orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined_march9.pkl'))

In [4]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked_march9.csv'), index_col = False)

## 03. Checking Data

In [5]:
#Checking Shape

df_orders_products_combined.shape

(32434489, 11)

Same number of rows as when exported in exercise

In [6]:
#Checking Shape

df_prods.shape

(49672, 6)

## 04. Merge orders_products_combined with Product Data

In [7]:
#Checking Columns

df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
#Dropping Column
df_prods_clean = df_prods.drop(columns= ['Unnamed: 0'])

In [9]:
#Ensure Column Dropped
df_prods_clean.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [10]:
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,New Customer,196,1,0,both
1,2539329,1,1,2,8,NaN,New Customer,14084,2,0,both
2,2539329,1,1,2,8,NaN,New Customer,12427,3,0,both
3,2539329,1,1,2,8,NaN,New Customer,26088,4,0,both
4,2539329,1,1,2,8,NaN,New Customer,26405,5,0,both

**Must merge on shared product_id column

In [18]:
#Merge dfs
df_ords_prods_merged = df_orders_products_combined.merge(df_prods_clean, on = 'product_id')

In [19]:
#Check shape
df_ords_prods_merged.shape

(32404859, 15)

In [20]:
#Confirm results of merge using merge flag
df_ords_prods_merged ['_merge'].value_counts()

both          32404859
right_only           0
left_only            0
Name: _merge, dtype: int64

In [21]:
#Checking new merged df
df_ords_prods_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices
0,2539329,1,1,2,8,NaN,New Customer,196,1,0,both,Soda,77,7,9.0
1,2398795,1,2,3,7,15.0,Repeat Customer,196,1,1,both,Soda,77,7,9.0
2,473747,1,3,3,12,21.0,Repeat Customer,196,1,1,both,Soda,77,7,9.0
3,2254736,1,4,4,7,29.0,Repeat Customer,196,1,1,both,Soda,77,7,9.0
4,431534,1,5,4,15,28.0,Repeat Customer,196,1,1,both,Soda,77,7,9.0

## 05. Export Merged Data

In [22]:
#Export newly merged dataframes

df_ords_prods_merged.to_pickle(os.path.join(path,'02 Data','Prepared Data', 'orders_products_merged_march9.pkl'))